{
  "architectures": [
    "CoDALanguageModel"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "attention_kernel": "flash_attention",
  "auto_map": {
    "AutoConfig": "model_config.CoDAConfig",
    "AutoModel": "modeling_coda.CoDALanguageModel"
  },
  "block_masking_probability": [
    0.25,
    0.5,
    0.5,
    0.75,
    0.25
  ],
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 6144,
  "mask_block_sizes": [
    4,
    8,
    16,
    32
  ],
  "mask_token_id": 151669,
  "max_position_embeddings": 40960,
  "max_window_layers": 28,
  "model_type": "CoDA",
  "num_attention_heads": 16,
  "num_hidden_layers": 28,
  "num_key_value_heads": 8,
  "pad_token_id": 151643,
  "prefix_probability": 0,
  "rms_norm_eps": 1e-6,
  "rope_scaling": null,
  "rope_theta": 1000000,
  "sampling_eps": [
    0.001,
    0.25,
    0.5,
    0.25,
    0.001
  ],
  "sliding_window": null,
  "torch_dtype": "float32",
  "transformers_version": "4.47.1",
  "truncate_probability": 0,
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 151936
}
